local skill = Skills["毒性射击"]
local mDamages1 = {50, 60, 70, 80, 90, 100}
local mDamages2 = {0.3, 0.3, 0.3, 0.3, 0.3, 0.3}
function skill:OnCast()

end

--[[Researchubertip = "提莫的普通攻击会使目标中毒，立即造成魔法伤害，并在随后的4秒里每秒造成魔法伤害。
|n1级：立即造成50+0.3*法术攻击的魔法伤害.之后造成每秒10+0.1*法术攻击的魔法伤害
|n2级：立即造成60+0.3*法术攻击的魔法伤害.之后造成每秒20+0.1*法术攻击的魔法伤害
|n3级：立即造成70+0.3*法术攻击的魔法伤害.之后造成每秒30+0.1*法术攻击的魔法伤害
|n4级：立即造成80+0.3*法术攻击的魔法伤害.之后造成每秒40+0.1*法术攻击的魔法伤害
|n5级：立即造成90+0.3*法术攻击的魔法伤害.之后造成每秒50+0.1*法术攻击的魔法伤害
|n6级：立即造成100+0.3*法术攻击的魔法伤害.之后造成每秒60+0.1*法术攻击的魔法伤害"]]