local skill = Skills["种蘑菇"]
local mDamages1 = {70, 90, 120, 140, 180, 220}
local mDamages2 = {0.5, 0.5, 0.5, 0.5, 0.5, 0.5}
function skill:OnCast()

end

--[[Researchubertip = "使用一个储存的蘑菇来投掷一个陷阱，如果被敌人踩到，陷阱会爆炸，
将毒散发到附近的敌人身上，减缓他们的移动速度，并在4秒里持续造成法术伤害。每个蘑菇最多持续60s。
每10s。回复一个蘑菇。最多可储存5个蘑菇。消耗60点蓝量。
|n1级：减缓10%移速。造成70+0.5*法术攻击的法术伤害.
|n2级：减缓10%移速。造成90+0.5*法术攻击的法术伤害.
|n3级：减缓10%移速。造成120+0.5*法术攻击的法术伤害.
|n4级：减缓10%移速。造成140+0.5*法术攻击的法术伤害.
|n5级：减缓10%移速。造成180+0.5*法术攻击的法术伤害.
|n6级：减缓10%移速。造成220+0.5*法术攻击的法术伤害."
]]